---
kind: method
id: M:Autodesk.Revit.DB.Electrical.InsulationTypeSet.ForwardIterator
source: html/0587e2c2-e4d9-4e30-26bf-efd92c1073a2.htm
---
# Autodesk.Revit.DB.Electrical.InsulationTypeSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual InsulationTypeSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.